oracle/solaris-xorg/open-src/app/xmakemap/sun-src/xmakemap.man
.\"
.\" Copyright 2001 Sun Microsystems, Inc.  All rights reserved.
.\" Use subject to license terms.
.\"
.\" Permission is hereby granted, free of charge, to any person obtaining a
.\" copy of this software and associated documentation files (the
.\" "Software"), to deal in the Software without restriction, including
.\" without limitation the rights to use, copy, modify, merge, publish,
.\" distribute, and/or sell copies of the Software, and to permit persons
.\" to whom the Software is furnished to do so, provided that the above
.\" copyright notice(s) and this permission notice appear in all copies of
.\" the Software and that both the above copyright notice(s) and this
.\" permission notice appear in supporting documentation.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
.\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT
.\" OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
.\" HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL
.\" INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING
.\" FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
.\" NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION
.\" WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\" 
.\" Except as contained in this notice, the name of a copyright holder
.\" shall not be used in advertising or otherwise to promote the sale, use
.\" or other dealings in this Software without prior written authorization
.\" of the copyright holder.
.\"
.TH xmakemap 1 "23 August 2001"
.SH NAME
xmakemap \- make a keyboard mapping to be used as input to xmodmap
.SH SYNOPSIS
.B xmakemap
.SH DESCRIPTION
.PP
.B xmakemap
will produce a keyboard mapping in a form that is suitable
as input to the
.BR xmodmap (1)
command.
.B xmakemap
writes its output to stdout.
Typical usage of
.B xmakemap
is to redirect output from
.B xmakemap
to a file (e.g., $HOME/.xmodmaprc), edit this file to make
necessary customizations, and then run
.B xmodmap
on the file (i.e., $HOME/.xmodmaprc).
.TP
For example:
.IP
.nf
\fLxmakemap > $HOME/.xmodmaprc
[... make necessary customization to $HOME/.xmodmaprc ...]
xmodmap $HOME/.xmodmaprc\fP
.fi
.LP
If you would like your keytable to be customized each time you start
an X session, you should place the appropriate command in the session
startup file for your desktop environment.
.TP
For example:
.IP
.nf
\fLif [ -f $HOME/.xmodmaprc ]; then
    xmodmap $HOME/.xmodmaprc
fi\fP
.LP
.SH NOTES
An X server must be running to use
.BR xmakemap .
.br
Read "Notes" in $HOME/.xmodmaprc.
.SH SEE ALSO
.BR xmodmap (1)
