oracle/solaris-xorg/open-src/lib/fontconfig/fc-cache.man
.\" $XConsortium: fc-cache.man,v 1.19 94/04/17 20:24:38 dpw Exp $
.\" Copyright (c) 1988  X Consortium
.\" Copyright (c) 1997  Sun Microsystems, Inc.
.\" 
.\" Permission is hereby granted, free of charge, to any person obtaining
.\" a copy of this software and associated documentation files (the
.\" "Software"), to deal in the Software without restriction, including
.\" without limitation the rights to use, copy, modify, merge, publish,
.\" distribute, sublicense, and/or sell copies of the Software, and to
.\" permit persons to whom the Software is furnished to do so, subject to
.\" the following conditions:
.\" 
.\" The above copyright notice and this permission notice shall be included
.\" in all copies or substantial portions of the Software.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
.\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
.\" IN NO EVENT SHALL THE X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR
.\" OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
.\" ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
.\" OTHER DEALINGS IN THE SOFTWARE.
.\" 
.\" Except as contained in this notice, the name of the X Consortium shall
.\" not be used in advertising or otherwise to promote the sale, use or
.\" other dealings in this Software without prior written authorization
.\" from the X Consortium.
.TH fc-cache  1 "Release 6" "X Version 11"
.SH NAME
fc-cache \- build font information cache files
.SH SYNOPSIS
.B fc-cache
[\-fsvV?] [\--force] [\--system-only] [\--verbose] [\--version] [\--help] [dirs]
.SH DESCRIPTION
.I fc-cache
scans the font directories on the system and builds font
information  cache  files  for  applications using fontconfig for
their font handling.
.PP
If directory arguments are not given, fc-cache uses  each
directory in the current font configuration. Each directory is scanned
for font files readable by FreeType. A  cache  is  created  which
contains  properties  of  each  font and the associated filename.
This cache is used to speed up application startup when using the
fontconfig library.

.SH "OPTIONS"
.PP
This program follows the usual GNU command line syntax, with long
options  starting  with two dashes (\--). A summary of options is
included belcw.
.PP
.TP 8
.B \-f --force
Fore-generation of apparently up-to-date cache  files,  over-
riding the timestamp checking.
.PP
.TP 8
.B \-s --system-only
Only scan system-wide directories, omitting the places located in
the user\'s home directory.
.PP
.TP 8
.B \-v --verbose
Display status information while busy.
.PP
.TP 8
.B \-? --help
Show summary of options.
.PP
.TP 8
.B \-V --version
Show version of the program and exit.
.PP
.TP 8
.B dirs
A list of directories to scan for fonts.
.PP
.SH "FILES"
fonts.cache-1

These files are generated by fc-cache and contain maps from  file
names to font properties. They are read by the fontconfig library
at application startup to locate  appropriate  fonts.
.PP
.SH "SEE ALSO"
.BR fc-list (1).
.I "The fontconfig user\'s  guide, in HTML format:
/usr/share/doc/fontconfig/fontconfig-user.html."
.SH  AUTHOR
This manual page was written by Keith Packard <keithp@keithp.com>
and Josselin Mouette <joss@debian.org>.
