oracle/solaris-xorg/open-src/lib/fontconfig/fc-list.man
.\" $XConsortium: fc-list.man,v 1.19 94/04/17 20:24:38 dpw Exp $
.\" Copyright (c) 1988  X Consortium
.\" Copyright (c) 1997  Sun Microsystems, Inc.
.\" 
.\" Permission is hereby granted, free of charge, to any person obtaining
.\" a copy of this software and associated documentation files (the
.\" "Software"), to deal in the Software without restriction, including
.\" without limitation the rights to use, copy, modify, merge, publish,
.\" distribute, sublicense, and/or sell copies of the Software, and to
.\" permit persons to whom the Software is furnished to do so, subject to
.\" the following conditions:
.\" 
.\" The above copyright notice and this permission notice shall be included
.\" in all copies or substantial portions of the Software.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
.\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
.\" IN NO EVENT SHALL THE X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR
.\" OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
.\" ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
.\" OTHER DEALINGS IN THE SOFTWARE.
.\" 
.\" Except as contained in this notice, the name of the X Consortium shall
.\" not be used in advertising or otherwise to promote the sale, use or
.\" other dealings in this Software without prior written authorization
.\" from the X Consortium.
.TH fc-list 1 "Release 6" "X Version 11"
.SH NAME
fc-list \- list available fonts
.SH SYNOPSIS
.B fc-list
[\-vV?] [\--verbose] [\--version] [\--help] [pattern] [element]
.SH DESCRIPTION
.I fc-list
lists fonts and styles available on the system for applications using fontconfig.
.SH "OPTIONS"
This program follows the usual GNU command line syntax, with long
options  starting  with two dashes (\--). A summary of options is
included below.

.PP
.TP 8
.B \-v --verbose
Display status information while busy.
.PP
.TP 8
.B -? --help
Show summary of options.
.TP 8
.B -V --version
Show version of the program and exit.
.TP 8
.B pattern
 (If this argument is set, only fonts matching pattern are displayed.)
.TP 8
.B element
 (If set, the element property is displayed for matching fonts.)
.PP
.SH "EXAMPLES"
.PP
.B fc-list
(Lists all font faces.)
.TP8
.B fc-list :lang=hi
(Lists font faces that cover Hindi.)
.TP8
.B fc-list : family style file spacing
(Lists the filename and spacing value for each font face. \: is
an empty pattern that matches all fonts.)
.PP
.SH "SEE ALSO"
.BR fc-cache (1).
.I "The fontconfig user\'s guide, in HTML format: /usr/share/doc/fontconfig/fontconfig-user.html."
.SH AUTHOR
This manual page was written by Keith Packard <keithp@keithp.com>
and Josselin Mouette <joss@debian.org>.
